[
    {
        "title": "Sun-Lovers Special",
        "year": 2025,
        "image": "../images/Project1.png",
        "imageClass": "project-image",
        "description": "An analytical deep dive into how solar energy adoption correlates with regional climate, income levels, and policy incentives. This project uses geospatial data and machine learning to predict solar panel viability across different states."
    },
    {
        "title": "Bad Graphs, Worse Intentions",
        "year": 2025,
        "image": "../images/thoracic.png",
        "imageClass": "project-image",
        "description": "An exploration of misleading data visualizations used in media and research. This project categorizes deceptive graphing techniques and evaluates their impact using sentiment analysis and survey-based experiments."
    },
    {
        "title": "Pokémon: Parsed",
        "year": 2025,
        "image": "../images/dancinglitwicks.gif",
        "imageClass": "project-image",
        "description": "A natural language processing (NLP) and computer vision approach to analyzing Pokémon game mechanics, player behavior, and competitive metagame trends using battle logs and forum discussions."
    },
    {
        "title": "Electrical Grid Americana",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "An infrastructure-focused data visualization project mapping the aging U.S. electrical grid, identifying outage-prone regions, and forecasting future failures using time-series analysis."
    },
    {
        "title": "Viewpoint Obstruction: Clouds or Fog?",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "A machine learning model trained on weather satellite data to classify obstructions in aerial imagery, distinguishing between cloud cover and fog to improve flight navigation predictions."
    },
    {
        "title": "Hit Me. BLACKJACK",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "A reinforcement learning project that trains AI agents to optimize Blackjack strategy, comparing different counting systems and probability-based decision-making techniques."
    },
    {
        "title": "Who's Driving this Thing?",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "An autonomous driving analysis that evaluates decision-making in self-driving cars, comparing human and AI driving styles using real-world sensor data from simulated urban environments."
    },
    {
        "title": "Deloitte Data Dive",
        "year": 2025,
        "image": "../images/delot.webp",
        "imageClass": "project-image",
        "description": "A comprehensive statistical analysis of socioeconomic factors influencing substance abuse in young adults, leveraging public health datasets and predictive modeling."
    },
    {
        "title": "Every City is a Walkable City if You're Strong Enough",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "A study on urban walkability and its correlation with health outcomes, measuring pedestrian accessibility and infrastructure quality across major U.S. cities."
    },
    {
        "title": "Sunt tempore natus quidem.",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "Veniam voluptas nihil dolorem fuga optio aspernatur architecto harum! Enim, facilis debitis perferendis distinctio magni nemo labore expedita provident eius saepe placeat natus iste nesciunt laboriosam aliquam sapiente ipsam esse?"
    },
    {
        "title": "Commodi, dolorem. Illo, a!",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "Minus aliquid nulla tempore praesentium alias, quia quisquam. Est amet earum et beatae numquam deserunt atque cupiditate pariatur nemo illum minima consequatur necessitatibus exercitationem consequuntur, debitis vel. Consequatur, omnis quaerat."
    },
    {
        "title": "Fuga distinctio odio hic.",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "imageClass": "project-image",
        "description": "Nihil voluptates similique fuga aspernatur nam recusandae cupiditate ipsum reiciendis facere unde. Dolore recusandae corporis pariatur, cumque asperiores repellendus ullam repudiandae optio laudantium blanditiis! Laboriosam accusantium dignissimos repudiandae tenetur consequuntur."
    }
]