[
    {
        "title": "Organ Trail — Personalized Predictive Health Platform",
        "year": 2025,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Built an interactive scrollable data experience using D3.js and HTML to surface personalized surgery statistics from a hospital database, featuring dynamic histograms and ridgeline plots."
    },
    {
        "title": "Autonomous Vehicle Development — 1st Place at Purdue",
        "year": 2025,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Optimized gradient descent–based steering algorithms for a scale autonomous go-kart, integrated GPS/IMU sensors in Docker environments, and won 1st place at Purdue's collegiate full-size go-kart race at 30 mph with autonomous emergency braking."
    },
    {
        "title": "Character-Level RNN for Reddit Sentiment Analysis",
        "year": 2024,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Engineered a custom character-level RNN in TensorFlow for sentiment analysis on Reddit comments from the top 200 subreddits, experimenting with batch size and sequence length hyperparameters and authoring an academic paper on tone in model-generated text."
    },
    {
        "title": "Seal Health Prediction Model",
        "year": 2024,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Analyzed environmental and economic datasets to assess human impact on Alaskan seal populations using ridge regression, PCA, and correlation heatmaps, identifying ocean traffic and coastal development as statistically significant predictors of seal weight."
    },
    {
        "title": "Amazon Purchase Dataset Analysis",
        "year": 2024,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Processed 16M+ rows of Amazon transaction data using AWS Lambda, Apache Spark, and EC2, implementing optimized batch computations of RMSE, one-hot encoding, and PCA within the AWS ecosystem."
    },
    {
        "title": "San Diego Parking Analysis",
        "year": 2024,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Designed a dynamic D3.js web app to help San Diego drivers identify optimal parking times and locations via daily frequency histograms and an interactive geospatial parking meter heatmap."
    },
    {
        "title": "Scripps Climate Research",
        "year": 2024,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Built Python pipelines to analyze 70+ years of climate data from 60 coastal airports using sliding-window PCA, polynomial regression, and ridge regression, with findings published in a paper linking urbanization to reduced cloud thickness and elevated local temperatures."
    },
    {
        "title": "Deloitte Drug Abuse Analysis",
        "year": 2023,
        "image": "images/place_holder.jpeg",
        "imageClass": "project-image",
        "description": "Analyzed USDHHS data using XGBoost, ridge regression, and linear regression to identify behavioral traits predictive of substance abuse in young adults, presenting actionable insights to senior Deloitte management via Seaborn and Plotly visualizations."
    }
]
